# ============================================================================
# # 파이썬에서 제공하는 기본 내장함수
# # 출력 함수(print)
# print()   # 줄바꿈 기능 & 출력
# print("안녕")


# # 길이 구하기 함수(len)
# length = len("python")
# print("python length:", length)
# print(len("python"))


# # 나눈 몫과 나머지 구하기(divmod)
# q, r = divmod(20, 3)   # 전달 인자값, 인수, argument
# print("몫:%d 나머지:%d" % (q, r))
# ============================================================================


# ============================================================================
# # 나만의 함수 만들기
# # 1.어떠한 기능을 하는 함수를 만들지 생각한다. 함수명 작성
# # 2.input 값으로 무엇을 받을 것인지 생각한다.
# # 3.output 값으로 무엇을 돌려줄 것인지 생각한다.
# # 4.구현한다.
# ============================================================================


# # 함수의 기본구조 def 함수명(매개변수)
# # 함수의 네가지 상태
# ============================================================================
# # 입력값, 출력값이 있는 가장 기본적인 함수 구조
# def num_plus(a, b):
#     result = a + b
#     return result   #result 없애고 a+b를 해도 무관

# plusvalue = num_plus(1,2)
# print(plusvalue)
# ============================================================================


# ============================================================================
# # 연습문제 01(입출력이 있는 함수)
# def mul (x, y) :
#     return x*y
# print(mul(2,3))
# ============================================================================


# ============================================================================
# # 연습문제 02(입출력이 있는 함수)
# # 정수 하나를 입력 받아 2제곱의 결과를 돌려주는 함수를 만들고 호출한 값을 출력하라.
# def squared(n):
#     result = n * n
#     return result

# number = int(input("정수를 입력하세요:"))
# result = squared(number)
# print("%d의 제곱은 %d이다." % (number, result))
# ============================================================================


# ============================================================================
# # 연습문제 03(입출력이 있는 함수)
# # 하나의 정수를 입력 받아 짝수면 True 홀수면 False을 돌려 주는 함수를 만드세요.
# def is_even(n):
#     if n % 2 == 0:
#         return True
#     else :
#         return False

# number = int(input("[홀짝 판별기]정수를 하나를 입력하세요(짝수 : True, 홀수 : False) : "))
# print(is_even(number))
# ============================================================================



# ============================================================================
# # 연습문제 04(원의 넓이)
# def circle_area(radius) :
#     result = radius**2 * 3.14
#     return result
# radius = float(input("반지름의 길이를 입력하세요. "))
# print(f"원의 넓이 : {circle_area(radius)}")
# ============================================================================


# ============================================================================
# # 1부터 n까지의 합계, 단, n의값은 100을 넘을수는 없다(break 활용)
# # ex) 1~10까지의 합 : 55, 1~100까지의 합 : 5050, 1~200까지의 합 : 5050
# def sum_limit_100(n):
#     sum = 0
#     for num in range(1, n + 1):  # 1 ~ n
#         if num > 100:
#             break
#             # return '오류'    
#         sum += num
#     return sum

# n = int(input("수를 입력하세요 :"))
# print(sum_limit_100(n))
# ============================================================================


# ============================================================================
# # 변수 text에 할당한 문자열의 단어 게수를 구하는 함수
# def w_count(text) :
#     words = text.split()
#     return len(words)

# text = "To be, or Not to Be. That Is The Question"
# print("문자열의 단어 개수는 %d개 입니다." % w_count(text))
# ============================================================================
